app/controllers/products_controller.rb

SELECT `products`.* FROM `products`
---
  def search
    searched_products = Product.all

SELECT `categories`.* FROM `categories`
---
  def set_categories
    @categories = Category.all

SELECT `products`.* FROM `products`
SELECT COUNT(*) FROM `products`
---
  def load_products
    @pagy, @products = pagy(Product.ordered_by_name,
                            items: Settings.product_per_page)

SELECT `categories`.* FROM `categories` WHERE `categories`.`id` = 3 LIMIT 1
---
  def filter_category products, category
    if category
      products = products.select do |product|
        Category.find_by(id: product.category_id).name == category